simplefoc/Arduino-FOC/src/drivers/hardware_specific/stm32/stm32_timerutils.cpp

#include "./stm32_timerutils.h"
#include <Arduino.h>

#if defined(_STM32_DEF_) || defined(TARGET_STM32H7) // if stm32duino or portenta

#if defined(HAL_TIM_MODULE_ONLY)

//Functions copied over and modified from HardwareTimer to allow disabling HardwareTimer

void enableTimerClock(TIM_HandleTypeDef *htim)
{
  // Enable TIM clock
#if defined(TIM1_BASE)
  if (htim->Instance == TIM1) {
    __HAL_RCC_TIM1_CLK_ENABLE();
  }
#endif
#if defined(TIM2_BASE)
  if (htim->Instance == TIM2) {
    __HAL_RCC_TIM2_CLK_ENABLE();
  }
#endif
#if defined(TIM3_BASE)
  if (htim->Instance == TIM3) {
    __HAL_RCC_TIM3_CLK_ENABLE();
  }
#endif
#if defined(TIM4_BASE)
  if (htim->Instance == TIM4) {
    __HAL_RCC_TIM4_CLK_ENABLE();
  }
#endif
#if defined(TIM5_BASE)
  if (htim->Instance == TIM5) {
    __HAL_RCC_TIM5_CLK_ENABLE();
  }
#endif
#if defined(TIM6_BASE)
  if (htim->Instance == TIM6) {
    __HAL_RCC_TIM6_CLK_ENABLE();
  }
#endif
#if defined(TIM7_BASE)
  if (htim->Instance == TIM7) {
    __HAL_RCC_TIM7_CLK_ENABLE();
  }
#endif
#if defined(TIM8_BASE)
  if (htim->Instance == TIM8) {
    __HAL_RCC_TIM8_CLK_ENABLE();
  }
#endif
#if defined(TIM9_BASE)
  if (htim->Instance == TIM9) {
    __HAL_RCC_TIM9_CLK_ENABLE();
  }
#endif
#if defined(TIM10_BASE)
  if (htim->Instance == TIM10) {
    __HAL_RCC_TIM10_CLK_ENABLE();
  }
#endif
#if defined(TIM11_BASE)
  if (htim->Instance == TIM11) {
    __HAL_RCC_TIM11_CLK_ENABLE();
  }
#endif
#if defined(TIM12_BASE)
  if (htim->Instance == TIM12) {
    __HAL_RCC_TIM12_CLK_ENABLE();
  }
#endif
#if defined(TIM13_BASE)
  if (htim->Instance == TIM13) {
    __HAL_RCC_TIM13_CLK_ENABLE();
  }
#endif
#if defined(TIM14_BASE)
  if (htim->Instance == TIM14) {
    __HAL_RCC_TIM14_CLK_ENABLE();
  }
#endif
#if defined(TIM15_BASE)
  if (htim->Instance == TIM15) {
    __HAL_RCC_TIM15_CLK_ENABLE();
  }
#endif
#if defined(TIM16_BASE)
  if (htim->Instance == TIM16) {
    __HAL_RCC_TIM16_CLK_ENABLE();
  }
#endif
#if defined(TIM17_BASE)
  if (htim->Instance == TIM17) {
    __HAL_RCC_TIM17_CLK_ENABLE();
  }
#endif
#if defined(TIM18_BASE)
  if (htim->Instance == TIM18) {
    __HAL_RCC_TIM18_CLK_ENABLE();
  }
#endif
#if defined(TIM19_BASE)
  if (htim->Instance == TIM19) {
    __HAL_RCC_TIM19_CLK_ENABLE();
  }
#endif
#if defined(TIM20_BASE)
  if (htim->Instance == TIM20) {
    __HAL_RCC_TIM20_CLK_ENABLE();
  }
#endif
#if defined(TIM21_BASE)
  if (htim->Instance == TIM21) {
    __HAL_RCC_TIM21_CLK_ENABLE();
  }
#endif
#if defined(TIM22_BASE)
  if (htim->Instance == TIM22) {
    __HAL_RCC_TIM22_CLK_ENABLE();
  }
#endif
}

uint8_t getTimerClkSrc(TIM_TypeDef *tim)
{
  uint8_t clkSrc = 0;

  if (tim != (TIM_TypeDef *)NC)
#if defined(STM32C0xx) || defined(STM32F0xx) || defined(STM32G0xx)
    /* TIMx source CLK is PCKL1 */
    clkSrc = 1;
#else
  {
    /* Get source clock depending on TIM instance */
    switch ((uint32_t)tim) {
#if defined(TIM2_BASE)
      case (uint32_t)TIM2_BASE:
#endif
#if defined(TIM3_BASE)
      case (uint32_t)TIM3_BASE:
#endif
#if defined(TIM4_BASE)
      case (uint32_t)TIM4_BASE:
#endif
#if defined(TIM5_BASE)
      case (uint32_t)TIM5_BASE:
#endif
#if defined(TIM6_BASE)
      case (uint32_t)TIM6_BASE:
#endif
#if defined(TIM7_BASE)
      case (uint32_t)TIM7_BASE:
#endif
#if defined(TIM12_BASE)
      case (uint32_t)TIM12_BASE:
#endif
#if defined(TIM13_BASE)
      case (uint32_t)TIM13_BASE:
#endif
#if defined(TIM14_BASE)
      case (uint32_t)TIM14_BASE:
#endif
#if defined(TIM18_BASE)
      case (uint32_t)TIM18_BASE:
#endif
        clkSrc = 1;
        break;
#if defined(TIM1_BASE)
      case (uint32_t)TIM1_BASE:
#endif
#if defined(TIM8_BASE)
      case (uint32_t)TIM8_BASE:
#endif
#if defined(TIM9_BASE)
      case (uint32_t)TIM9_BASE:
#endif
#if defined(TIM10_BASE)
      case (uint32_t)TIM10_BASE:
#endif
#if defined(TIM11_BASE)
      case (uint32_t)TIM11_BASE:
#endif
#if defined(TIM15_BASE)
      case (uint32_t)TIM15_BASE:
#endif
#if defined(TIM16_BASE)
      case (uint32_t)TIM16_BASE:
#endif
#if defined(TIM17_BASE)
      case (uint32_t)TIM17_BASE:
#endif
#if defined(TIM19_BASE)
      case (uint32_t)TIM19_BASE:
#endif
#if defined(TIM20_BASE)
      case (uint32_t)TIM20_BASE:
#endif
#if defined(TIM21_BASE)
      case (uint32_t)TIM21_BASE:
#endif
#if defined(TIM22_BASE)
      case (uint32_t)TIM22_BASE:
#endif
        clkSrc = 2;
        break;
      default:
        _Error_Handler("TIM: Unknown timer instance", (int)tim);
        break;
    }
  }
#endif
  return clkSrc;
}
#endif

void stm32_pauseTimer(TIM_HandleTypeDef* handle){
  /* Disable timer unconditionally. Required to guarantee timer is stopped,
   * even if some channels are still running */
  LL_TIM_DisableCounter(handle->Instance);
//  handle->State = HAL_TIM_STATE_READY;
  // on advanced control timers there is also the option of using the brake or the MOE?
  // TIM1->EGR |= TIM_EGR_BG; // break generation
}


void stm32_resumeTimer(TIM_HandleTypeDef* handle){
  LL_TIM_EnableCounter(handle->Instance);
}


void stm32_refreshTimer(TIM_HandleTypeDef* handle){
  handle->Instance->EGR = TIM_EVENTSOURCE_UPDATE;
}


void stm32_pauseChannel(TIM_HandleTypeDef* handle, uint32_t llchannels){
    LL_TIM_CC_DisableChannel(handle->Instance, llchannels);
}


void stm32_resumeChannel(TIM_HandleTypeDef* handle, uint32_t llchannels){
    LL_TIM_CC_EnableChannel(handle->Instance, llchannels);
}








uint32_t stm32_setClockAndARR(TIM_HandleTypeDef* handle, uint32_t PWM_freq) {
  // set the clock
  uint32_t arr_value = 0;
  uint32_t cycles = stm32_getTimerClockFreq(handle) / PWM_freq / 2;
  uint32_t prescaler = (cycles / 0x10000) + 1; // TODO consider 32 bit timers
  LL_TIM_SetPrescaler(handle->Instance, prescaler - 1);
  uint32_t ticks = cycles / prescaler;
  if (ticks > 0) {
    arr_value = ticks - 1;
  }
  __HAL_TIM_SET_AUTORELOAD(handle, arr_value);
  stm32_refreshTimer(handle);
  // #ifdef SIMPLEFOC_STM32_DEBUG
  //   SIMPLEFOC_DEBUG("STM32-DRV: Timer clock: ", (int)stm32_getTimerClockFreq(handle));
  //   SIMPLEFOC_DEBUG("STM32-DRV: Timer prescaler: ", (int)prescaler);
  //   SIMPLEFOC_DEBUG("STM32-DRV: Timer ARR: ", (int)arr_value);
  // #endif
  return arr_value;
}





// setting pwm to hardware pin - instead analogWrite()
void stm32_setPwm(TIM_HandleTypeDef *timer, uint32_t channel, uint32_t value) {
  // value assumed to be in correct range
  switch (channel) {
    case 1: timer->Instance->CCR1 = value; break;
    case 2: timer->Instance->CCR2 = value; break;
    case 3: timer->Instance->CCR3 = value; break;
    case 4: timer->Instance->CCR4 = value; break;
    #ifdef LL_TIM_CHANNEL_CH5
    case 5: timer->Instance->CCR5 = value; break;
    #endif
    #ifdef LL_TIM_CHANNEL_CH6
    case 6: timer->Instance->CCR6 = value; break;
    #endif
    default: break;
  }
}


uint32_t stm32_getHALChannel(uint32_t channel) {
  uint32_t return_value;
  switch (channel) {
    case 1:
      return_value = TIM_CHANNEL_1;
      break;
    case 2:
      return_value = TIM_CHANNEL_2;
      break;
    case 3:
      return_value = TIM_CHANNEL_3;
      break;
    case 4:
      return_value = TIM_CHANNEL_4;
      break;
    #ifdef TIM_CHANNEL_5
    case 5:
      return_value = TIM_CHANNEL_5;
      break;
    #endif
    #ifdef TIM_CHANNEL_6
    case 6:
      return_value = TIM_CHANNEL_6;
      break;
    #endif
    default:
      return_value = -1;
  }
  return return_value;
}



uint32_t stm32_getLLChannel(PinMap* timer) {
#if defined(TIM_CCER_CC1NE)
  if (STM_PIN_INVERTED(timer->function)) {
    switch (STM_PIN_CHANNEL(timer->function)) {
      case 1: return LL_TIM_CHANNEL_CH1N;
      case 2: return LL_TIM_CHANNEL_CH2N;
      case 3: return LL_TIM_CHANNEL_CH3N;
#if defined(LL_TIM_CHANNEL_CH4N)
      case 4: return LL_TIM_CHANNEL_CH4N;
#endif
      default: return -1;
    }
  } else
#endif
  {
    switch (STM_PIN_CHANNEL(timer->function)) {
      case 1: return LL_TIM_CHANNEL_CH1;
      case 2: return LL_TIM_CHANNEL_CH2;
      case 3: return LL_TIM_CHANNEL_CH3;
      case 4: return LL_TIM_CHANNEL_CH4;
  #ifdef LL_TIM_CHANNEL_CH5
      case 5: return LL_TIM_CHANNEL_CH5;
  #endif
  #ifdef LL_TIM_CHANNEL_CH6
      case 6: return LL_TIM_CHANNEL_CH6;
  #endif
      default: return -1;
    }
  }
  return -1;
}



