simplefoc/Arduino-FOC/src/drivers/hardware_specific/stm32/stm32_timerutils.cpp
uint8_t stm32_countTimers(TIM_HandleTypeDef *timers[], uint8_t num_timers) {
  uint8_t count = 1;
  for (int i=1; i<num_timers; i++) {
    if (timers[i] != NULL) break;
    bool found = false;
    for (int j=0; j<i; j++) {
      if (timers[i] == timers[j]) { 
        found = true;
        break;
      }
    }
    if (found==false)
      count++;
  }
  return count;
}

uint8_t stm32_distinctTimers(TIM_HandleTypeDef* timers_in[], uint8_t num_timers, TIM_HandleTypeDef* timers_out[]) {
  uint8_t count = 0;
  for (int i=0; i<num_timers; i++) {
    if (timers_in[i] == NULL) continue;
    bool found = false;
    for (int j=0; j<count; j++) {
      if (timers_in[i] == timers_out[j]) {
        found = true;
        break;
      }
    }
    if (found==false)
      timers_out[count++] = timers_in[i];
  }
  return count;
}



#if defined(STM32G4xx)
// function finds the appropriate timer source trigger for the master/slave timer combination
// returns -1 if no trigger source is found
// currently supports the master timers to be from TIM1 to TIM4 and TIM8
int stm32_getInternalSourceTrigger(TIM_HandleTypeDef* master, TIM_HandleTypeDef* slave) { // put master and slave in temp variables to avoid arrows
  TIM_TypeDef *TIM_master = master->Instance;
  #if defined(TIM1) && defined(LL_TIM_TS_ITR0)
    if (TIM_master == TIM1) return LL_TIM_TS_ITR0;// return TIM_TS_ITR0;
  #endif
  #if defined(TIM2) &&  defined(LL_TIM_TS_ITR1)
    else if (TIM_master == TIM2) return LL_TIM_TS_ITR1;//return TIM_TS_ITR1;
  #endif
  #if defined(TIM3) &&  defined(LL_TIM_TS_ITR2)
    else if (TIM_master == TIM3) return LL_TIM_TS_ITR2;//return TIM_TS_ITR2;
  #endif  
  #if defined(TIM4) &&  defined(LL_TIM_TS_ITR3)
    else if (TIM_master == TIM4) return LL_TIM_TS_ITR3;//return TIM_TS_ITR3;
  #endif 
  #if defined(TIM5) &&  defined(LL_TIM_TS_ITR4)
    else if (TIM_master == TIM5) return LL_TIM_TS_ITR4;//return TIM_TS_ITR4;
  #endif
  #if defined(TIM8) &&  defined(LL_TIM_TS_ITR5)
    else if (TIM_master == TIM8) return LL_TIM_TS_ITR5;//return TIM_TS_ITR5;
  #endif
  return -1;
}
#elif defined(STM32F4xx) || defined(STM32F1xx) || defined(STM32L4xx) || defined(STM32F7xx) || defined(STM32H7xx) || defined(TARGET_STM32H7)

// function finds the appropriate timer source trigger for the master/slave timer combination
// returns -1 if no trigger source is found
// currently supports the master timers to be from
// 
//   fammilies     | timers
//   --------------| --------------------------------
//   f1,f4,f7      | TIM1 to TIM4 and TIM8
//   l4            | TIM1 to TIM4, TIM8 and TIM15
//   h7            | TIM1 to TIM5, TIM8, TIM15, TIM23 and TIM24
int stm32_getInternalSourceTrigger(TIM_HandleTypeDef* master, TIM_HandleTypeDef* slave) {
  // put master and slave in temp variables to avoid arrows
  TIM_TypeDef *TIM_master = master->Instance;
  TIM_TypeDef *TIM_slave = slave->Instance;
  #if defined(TIM1) && defined(LL_TIM_TS_ITR0)
    if (TIM_master == TIM1){
      #if defined(TIM2)
      if(TIM_slave == TIM2) return LL_TIM_TS_ITR0;
      #endif
      #if defined(TIM3)
      else if(TIM_slave == TIM3) return LL_TIM_TS_ITR0;
      #endif
      #if defined(TIM4)
      else if(TIM_slave == TIM4) return LL_TIM_TS_ITR0;
      #endif
      #if defined(TIM8)
      else if(TIM_slave == TIM8) return LL_TIM_TS_ITR0;
      #endif
      #if defined(STM32H7xx) || defined(TARGET_STM32H7)
        #if defined(TIM23)
        else if(TIM_slave == TIM23) return LL_TIM_TS_ITR0;
        #endif
        #if defined(TIM24)
        else if(TIM_slave == TIM24) return LL_TIM_TS_ITR0;
        #endif
      #endif
    }
  #endif
  #if defined(TIM2) &&  defined(LL_TIM_TS_ITR1)
    else if (TIM_master == TIM2){
      #if defined(TIM1)
      if(TIM_slave == TIM1) return LL_TIM_TS_ITR1;
      #endif
      #if defined(TIM3)
      else if(TIM_slave == TIM3) return LL_TIM_TS_ITR1;
      #endif
      #if defined(TIM4)
      else if(TIM_slave == TIM4) return LL_TIM_TS_ITR1;
      #endif
      #if defined(TIM8)
      else if(TIM_slave == TIM8) return LL_TIM_TS_ITR1;
      #endif
      #if defined(STM32H7xx) || defined(TARGET_STM32H7)
        #if defined(TIM23)
        else if(TIM_slave == TIM23) return LL_TIM_TS_ITR1;
        #endif
        #if defined(TIM24)
        else if(TIM_slave == TIM24) return LL_TIM_TS_ITR1;
        #endif
      #else
        #if defined(TIM5) 
        else if(TIM_slave == TIM5) return LL_TIM_TS_ITR0;
        #endif
      #endif
    }
  #endif
  #if defined(TIM3) &&  defined(LL_TIM_TS_ITR2)
    else if (TIM_master == TIM3){
      #if defined(TIM1)
      if(TIM_slave == TIM1) return LL_TIM_TS_ITR2;
      #endif
      #if defined(TIM2)
      else if(TIM_slave == TIM2) return LL_TIM_TS_ITR2;
      #endif
      #if defined(TIM4)
      else if(TIM_slave == TIM4) return LL_TIM_TS_ITR2;
      #endif
      #if defined(STM32H7xx) || defined(TARGET_STM32H7)
        #if defined(TIM5)
        else if(TIM_slave == TIM5) return LL_TIM_TS_ITR2;
        #endif
        #if defined(TIM23)
        else if(TIM_slave == TIM23) return LL_TIM_TS_ITR2;
        #endif
        #if defined(TIM24)
        else if(TIM_slave == TIM24) return LL_TIM_TS_ITR2;
        #endif
      #else
        #if defined(TIM5)
        else if(TIM_slave == TIM5) return LL_TIM_TS_ITR1;
        #endif
      #endif
    }
  #endif  
  #if defined(TIM4) &&  defined(LL_TIM_TS_ITR3)
    else if (TIM_master == TIM4){
      #if defined(TIM1)
      if(TIM_slave == TIM1) return LL_TIM_TS_ITR3;
      #endif
      #if defined(TIM2)
      else if(TIM_slave == TIM2) return LL_TIM_TS_ITR3;
      #endif
      #if defined(TIM3)
      else if(TIM_slave == TIM3) return LL_TIM_TS_ITR3;
      #endif
      #if defined(TIM8)
      else if(TIM_slave == TIM8) return LL_TIM_TS_ITR2;
      #endif

      #if defined(STM32H7xx) || defined(TARGET_STM32H7)
        #if defined(TIM5)
        else if(TIM_slave == TIM5) return LL_TIM_TS_ITR3;
        #endif
        #if defined(TIM23)
        else if(TIM_slave == TIM23) return LL_TIM_TS_ITR3;
        #endif
        #if defined(TIM24)
        else if(TIM_slave == TIM24) return LL_TIM_TS_ITR3;
        #endif
      #else
        #if defined(TIM5)
        else if(TIM_slave == TIM5) return LL_TIM_TS_ITR2;
        #endif
      #endif
    }
  #endif 
  #if defined(TIM5) 
    else if (TIM_master == TIM5){
      #if defined(STM32F4xx) || defined(STM32F1xx) || defined(STM32F7xx) // f1, f4 adn f7 have tim5 sycned with tim1 and tim3 while others (l4, h7) have tim15
      #if defined(TIM1)
      if(TIM_slave == TIM1) return LL_TIM_TS_ITR0;
      #endif
      #if defined(TIM3)
      else if(TIM_slave == TIM3) return LL_TIM_TS_ITR2;
      #endif
      #endif
      #if defined(TIM8)
      if(TIM_slave == TIM8) return LL_TIM_TS_ITR3;
      #endif

      #if defined(STM32H7xx) || defined(TARGET_STM32H7)
        #if defined(TIM23)
        else if(TIM_slave == TIM23) return LL_TIM_TS_ITR4;
        #endif
        #if defined(TIM24)
        else if(TIM_slave == TIM24) return LL_TIM_TS_ITR4;
        #endif
      #endif
    }
  #endif
  #if defined(TIM8)
    else if (TIM_master == TIM8){
      #if defined(TIM2)
      if(TIM_slave==TIM2) return LL_TIM_TS_ITR1;
      #endif
      #if defined(TIM4)
      else if(TIM_slave == TIM4) return LL_TIM_TS_ITR3;
      #endif

      #if defined(STM32H7xx) || defined(TARGET_STM32H7)
        #if defined(TIM5)
        else if(TIM_slave == TIM5) return LL_TIM_TS_ITR1;
        #endif
        #if defined(TIM23)
        else if(TIM_slave == TIM23) return LL_TIM_TS_ITR5;
        #endif
        #if defined(TIM24)
        else if(TIM_slave == TIM24) return LL_TIM_TS_ITR5;
        #endif
      #else
        #if defined(TIM5)
        else if(TIM_slave == TIM5) return LL_TIM_TS_ITR3;
        #endif
      #endif
    }
  #endif
  #if defined(TIM15) && (defined(STM32L4xx) || defined(STM32H7xx) || defined(TARGET_STM32H7) )
    else if (TIM_master == TIM15){
      #if defined(TIM1)
      if(TIM_slave == TIM1) return LL_TIM_TS_ITR0;
      #endif
      #if defined(TIM3)
      if(TIM_slave == TIM3) return LL_TIM_TS_ITR2;
      #endif
    }
  #endif
  #if defined(TIM23) && (defined(STM32H7xx) || defined(TARGET_STM32H7))
    else if (TIM_master == TIM23){
      #if defined(TIM1)
      if(TIM_slave == TIM1) return LL_TIM_TS_ITR12;
      #endif
      #if defined(TIM2)
      if(TIM_slave == TIM2) return LL_TIM_TS_ITR12;
      #endif
      #if defined(TIM3)
      if(TIM_slave == TIM3) return LL_TIM_TS_ITR12;
      #endif
      #if defined(TIM4)
      if(TIM_slave == TIM4) return LL_TIM_TS_ITR12;
      #endif
      #if defined(TIM5)
      if(TIM_slave == TIM5) return LL_TIM_TS_ITR12;
      #endif
      #if defined(TIM8)
      if(TIM_slave == TIM8) return LL_TIM_TS_ITR12;
      #endif
      #if defined(TIM24)
      if(TIM_slave == TIM24) return LL_TIM_TS_ITR12;
      #endif
    }
  #endif
  #if defined(TIM24) && (defined(STM32H7xx) || defined(TARGET_STM32H7))
    else if (TIM_master == TIM24){
      #if defined(TIM1)
      if(TIM_slave == TIM1) return LL_TIM_TS_ITR13;
      #endif
      #if defined(TIM2)
      if(TIM_slave == TIM2) return LL_TIM_TS_ITR13;
      #endif
      #if defined(TIM3)
      if(TIM_slave == TIM3) return LL_TIM_TS_ITR13;
      #endif
      #if defined(TIM4)
      if(TIM_slave == TIM4) return LL_TIM_TS_ITR13;
      #endif
      #if defined(TIM5)
      if(TIM_slave == TIM5) return LL_TIM_TS_ITR13;
      #endif
      #if defined(TIM8)
      if(TIM_slave == TIM8) return LL_TIM_TS_ITR13;
      #endif
      #if defined(TIM23)
      if(TIM_slave == TIM23) return LL_TIM_TS_ITR13;
      #endif
    }
  #endif
  return -1; // combination not supported
}
#else
// Alignment not supported for this architecture
int stm32_getInternalSourceTrigger(TIM_HandleTypeDef* master, TIM_HandleTypeDef* slave) {
  return -1;
}
#endif





// call with the timers used for a motor. The function will align the timers and
// start them at the same time (if possible). Results of this function can be:
//  - success, no changes needed
//  - success, different timers aligned and started concurrently
//  - failure, cannot align timers
// in each case, the timers are started.
//
// TODO: this topic is quite complex if we allow multiple motors and multiple timers per motor.
//       that's because the motors could potentially share the same timer. In this case aligning
//       the timers is problematic.
//       Even more problematic is stopping and resetting the timers. Even with a single motor,
//       this would cause problems and mis-align the PWM signals.
// We can handle three cases:
//   - only one timer needed, no need to align
//   - master timer can be found, and timers used by only this motor: alignment possible
//   - TODO all timers for all motors can be aligned to one master: alignment possible
//   - otherwise, alignment not possible
// frequency alignment is based on checking their pwm frequencies match.
// pwm alignment is based on linking timers to start them at the same time, and making sure they are reset in sync.
// On newer chips supporting it (STM32G4) we use gated + reset mode to start/stop only the master timer. Slaves 
// are started/stopped automatically with the master. TODO probably just using gated mode is better
// On older chips (STM32F1) we used gated mode to start/stop the slave timers with the master, but have to take
// care of the reset manually. TODO is it really needed to reset the timers?
TIM_HandleTypeDef* stm32_alignTimers(TIM_HandleTypeDef *timers_in[], uint8_t num_timers_in) {
  // find the timers used
  TIM_HandleTypeDef *timers[6];
  int numTimers = stm32_distinctTimers(timers_in, num_timers_in, timers);

