simplefoc/Arduino-FOC/src/drivers/hardware_specific/stm32/stm32_timerutils.cpp
#if defined(__MBED__)

void enableTimerClock(TIM_HandleTypeDef *htim) {
  // Enable TIM clock
#if defined(TIM1_BASE)
  if (htim->Instance == TIM1) {
    __HAL_RCC_TIM1_CLK_ENABLE();
  }
#endif
#if defined(TIM2_BASE)
  if (htim->Instance == TIM2) {
    __HAL_RCC_TIM2_CLK_ENABLE();
  }
#endif
#if defined(TIM3_BASE)
  if (htim->Instance == TIM3) {
    __HAL_RCC_TIM3_CLK_ENABLE();
  }
#endif
#if defined(TIM4_BASE)
  if (htim->Instance == TIM4) {
    __HAL_RCC_TIM4_CLK_ENABLE();
  }
#endif
#if defined(TIM5_BASE)
  if (htim->Instance == TIM5) {
    __HAL_RCC_TIM5_CLK_ENABLE();
  }
#endif
#if defined(TIM6_BASE)
  if (htim->Instance == TIM6) {
    __HAL_RCC_TIM6_CLK_ENABLE();
  }
#endif
#if defined(TIM7_BASE)
  if (htim->Instance == TIM7) {
    __HAL_RCC_TIM7_CLK_ENABLE();
  }
#endif
#if defined(TIM8_BASE)
  if (htim->Instance == TIM8) {
    __HAL_RCC_TIM8_CLK_ENABLE();
  }
#endif
#if defined(TIM9_BASE)
  if (htim->Instance == TIM9) {
    __HAL_RCC_TIM9_CLK_ENABLE();
  }
#endif
#if defined(TIM10_BASE)
  if (htim->Instance == TIM10) {
    __HAL_RCC_TIM10_CLK_ENABLE();
  }
#endif
#if defined(TIM11_BASE)
  if (htim->Instance == TIM11) {
    __HAL_RCC_TIM11_CLK_ENABLE();
  }
#endif
#if defined(TIM12_BASE)
  if (htim->Instance == TIM12) {
    __HAL_RCC_TIM12_CLK_ENABLE();
  }
#endif
#if defined(TIM13_BASE)
  if (htim->Instance == TIM13) {
    __HAL_RCC_TIM13_CLK_ENABLE();
  }
#endif
#if defined(TIM14_BASE)
  if (htim->Instance == TIM14) {
    __HAL_RCC_TIM14_CLK_ENABLE();
  }
#endif
#if defined(TIM15_BASE)
  if (htim->Instance == TIM15) {
    __HAL_RCC_TIM15_CLK_ENABLE();
  }
#endif
#if defined(TIM16_BASE)
  if (htim->Instance == TIM16) {
    __HAL_RCC_TIM16_CLK_ENABLE();
  }
#endif
#if defined(TIM17_BASE)
  if (htim->Instance == TIM17) {
    __HAL_RCC_TIM17_CLK_ENABLE();
  }
#endif
#if defined(TIM18_BASE)
  if (htim->Instance == TIM18) {
    __HAL_RCC_TIM18_CLK_ENABLE();
  }
#endif
#if defined(TIM19_BASE)
  if (htim->Instance == TIM19) {
    __HAL_RCC_TIM19_CLK_ENABLE();
  }
#endif
#if defined(TIM20_BASE)
  if (htim->Instance == TIM20) {
    __HAL_RCC_TIM20_CLK_ENABLE();
  }
#endif
#if defined(TIM21_BASE)
  if (htim->Instance == TIM21) {
    __HAL_RCC_TIM21_CLK_ENABLE();
  }
#endif
#if defined(TIM22_BASE)
  if (htim->Instance == TIM22) {
    __HAL_RCC_TIM22_CLK_ENABLE();
  }
#endif
}


uint8_t getTimerClkSrc(TIM_TypeDef *tim) {
  uint8_t clkSrc = 0;

  if (tim != (TIM_TypeDef *)NC)
#if defined(STM32C0xx) || defined(STM32F0xx) || defined(STM32G0xx)
    /* TIMx source CLK is PCKL1 */
    clkSrc = 1;
#else
  {
    if (
      #if defined(TIM2_BASE)
            tim == TIM2 ||
      #endif
      #if defined(TIM3_BASE)
            tim == TIM3 ||
      #endif
      #if defined(TIM4_BASE)
            tim == TIM4 ||
      #endif
      #if defined(TIM5_BASE)
            tim == TIM5 ||
      #endif
      #if defined(TIM6_BASE)
            tim == TIM6 ||
      #endif
      #if defined(TIM7_BASE)
            tim == TIM7 ||
      #endif
      #if defined(TIM12_BASE)
            tim == TIM12 ||
      #endif
      #if defined(TIM13_BASE)
            tim == TIM13 ||
      #endif
      #if defined(TIM14_BASE)
            tim == TIM14 ||
      #endif
      #if defined(TIM18_BASE)
            tim == TIM18 ||
      #endif
      false)
        clkSrc = 1;
  else
    if (
      #if defined(TIM1_BASE)
            tim == TIM1 ||
      #endif
      #if defined(TIM8_BASE)
            tim == TIM8 ||
      #endif
      #if defined(TIM9_BASE)
            tim == TIM9 ||
      #endif
      #if defined(TIM10_BASE)
            tim == TIM10 ||
      #endif
      #if defined(TIM11_BASE)
            tim == TIM11 ||
      #endif
      #if defined(TIM15_BASE)
            tim == TIM15 ||
      #endif
      #if defined(TIM16_BASE)
            tim == TIM16 ||
      #endif
      #if defined(TIM17_BASE)
            tim == TIM17 ||
      #endif
      #if defined(TIM19_BASE)
            tim == TIM19 ||
      #endif
      #if defined(TIM20_BASE)
            tim == TIM20 ||
      #endif
      #if defined(TIM21_BASE)
            tim == TIM21 ||
      #endif
      #if defined(TIM22_BASE)
            tim == TIM22 ||
      #endif
      false )
        clkSrc = 2;
    else
        return 0;
  }
#endif
  return clkSrc;
}

#endif








#if defined(SIMPLEFOC_STM32_DEBUG) && !defined(SIMPLEFOC_DISABLE_DEBUG) 

/*
    some utility functions to print out the timer combinations
*/

int stm32_getTimerNumber(TIM_TypeDef *instance) {
  #if defined(TIM1_BASE)
    if (instance==TIM1) return 1;
  #endif
  #if defined(TIM2_BASE)
    if (instance==TIM2) return 2;
  #endif
  #if defined(TIM3_BASE)
    if (instance==TIM3) return 3;
  #endif
  #if defined(TIM4_BASE)
    if (instance==TIM4) return 4;
  #endif
  #if defined(TIM5_BASE)
    if (instance==TIM5) return 5;
  #endif
  #if defined(TIM6_BASE)
    if (instance==TIM6) return 6;
  #endif
  #if defined(TIM7_BASE)
    if (instance==TIM7) return 7;
  #endif
  #if defined(TIM8_BASE)
    if (instance==TIM8) return 8;
  #endif
  #if defined(TIM9_BASE)
    if (instance==TIM9) return 9;
  #endif
  #if defined(TIM10_BASE)
    if (instance==TIM10) return 10;
  #endif
  #if defined(TIM11_BASE)
    if (instance==TIM11) return 11;
  #endif
  #if defined(TIM12_BASE)
    if (instance==TIM12) return 12;
  #endif
  #if defined(TIM13_BASE)
    if (instance==TIM13) return 13;
  #endif
  #if defined(TIM14_BASE)
    if (instance==TIM14) return 14;
  #endif
  #if defined(TIM15_BASE)
    if (instance==TIM15) return 15;
  #endif
  #if defined(TIM16_BASE)
    if (instance==TIM16) return 16;
  #endif
  #if defined(TIM17_BASE)
    if (instance==TIM17) return 17;
  #endif
  #if defined(TIM18_BASE)
    if (instance==TIM18) return 18;
  #endif
  #if defined(TIM19_BASE)
    if (instance==TIM19) return 19;
  #endif
  #if defined(TIM20_BASE)
    if (instance==TIM20) return 20;
  #endif
  #if defined(TIM21_BASE)
    if (instance==TIM21) return 21;
  #endif
  #if defined(TIM22_BASE)
    if (instance==TIM22) return 22;
  #endif
  return -1;
}


void stm32_printTimerCombination(int numPins, PinMap* timers[], int score) {
  for (int i=0; i<numPins; i++) {
    if (timers[i] == NULL)
      SimpleFOCDebug::print("NP");
    else {
      SimpleFOCDebug::print("TIM");
      SimpleFOCDebug::print(stm32_getTimerNumber((TIM_TypeDef*)timers[i]->peripheral));
      SimpleFOCDebug::print("-CH");
      SimpleFOCDebug::print(STM_PIN_CHANNEL(timers[i]->function));
      if (STM_PIN_INVERTED(timers[i]->function))
        SimpleFOCDebug::print("N");
    }
    SimpleFOCDebug::print(" ");
  }
  SimpleFOCDebug::println("score: ", score);
}

#endif


#endif
